In [4]:
# importing libraries
import numpy as np
import pandas as pd

In [5]:
# TASK 1
# Create a dummy dataframe (or load one) with an index of daily dates for the year 2023.
# Generate random "Sales" data for each day.
# Resample this daily data to find the Total (Sum) Sales per Month.

# Create a dummy dataframe with daily dates for the year 2023
date_range = pd.date_range(start='2023-01-01', end='2023-12-31', freq='D')

# Random sales data between 100 and 500
sales_data = np.random.randint(100, 500 + 1, size=len(date_range))  

df = pd.DataFrame({'Date': date_range, 'Sales': sales_data})

# Set 'Date' as the index
df.set_index('Date', inplace=True)  
df.head()

            Sales
Date
2023-01-01    416
2023-01-02    149
2023-01-03    125
2023-01-04    299
2023-01-05    438

In [6]:
# Resample the data to find total sales per month
df_monthly_sales = df.resample("M").sum() 
df_monthly_sales

            Sales
Date
2023-01-31   8725
2023-02-28   7822
2023-03-31   9831
2023-04-30   9154
2023-05-31   9326
2023-06-30  10304
2023-07-31   9128
2023-08-31   8532
2023-09-30   9468
2023-10-31   9207
2023-11-30   9407
2023-12-31  10354

In [7]:
# TASK 2
# Create a small dataframe with columns: ['Date', 'Region', 'Sales']. 
# Populate it with data for 3 regions (North, South, East) over 5 different dates.
# Use pivot() to reshape this data so that:
# -- Date is the Index.
# -- Region names are the Columns (North, South, East).
# -- Sales are the Values.

data = pd.DataFrame({"Date": pd.date_range(start='2023-01-01', periods=5, freq='D'),
                     "Region": ['North', 'South', 'East', 'North', 'South'],
                     "Sales": [200, 150, 300, 250, 100]})
data

        Date Region  Sales
0 2023-01-01  North    200
1 2023-01-02  South    150
2 2023-01-03   East    300
3 2023-01-04  North    250
4 2023-01-05  South    100

In [8]:
data_pivot = data.pivot(index='Date', columns='Region', values='Sales')
data_pivot

Region       East  North  South
Date
2023-01-01    NaN  200.0    NaN
2023-01-02    NaN    NaN  150.0
2023-01-03  300.0    NaN    NaN
2023-01-04    NaN  250.0    NaN
2023-01-05    NaN    NaN  100.0

In [ ]:
# TASK 3
# import the "tips" dataset
tips = pd.read_csv("./data/tips.csv")

tips.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

In [10]:
# create a Pivot Table that shows:
# Rows: Day of the Week.
# Columns: Time (Lunch vs. Dinner).
# Values: Total Bill.
# Aggregation: Calculate the Average (mean) bill size.
# Margins: Include the "All" row/column totals.

pivot_table = tips.pivot_table(index="day", columns="time", values="total_bill", aggfunc="mean", margins=True)
pivot_table

time     Dinner      Lunch        All
day
Fri   19.663333  12.845714  17.151579
Sat   20.441379        NaN  20.441379
Sun   21.410000        NaN  21.410000
Thur  18.780000  17.664754  17.682742
All   20.797159  17.168676  19.785943